import 'package:flutter_riverpod/flutter_riverpod.dart';
import 'package:freedu_frontend/models/course_class.dart';
import 'package:freedu_frontend/models/user_class.dart';

final listCoursesState = StateProvider<List<Course>?>((ref) => [
  Course(id: 1, name: "Давайте рисовать!", numberStudents: 8, creator: User(name: "Марат Гумеров"), tags: ["Искусство"],
      description: "Описание описание описание описание описание описание реальн описание описание описание описание "
          "описание описание реальн описание описание описание описание описание описание реальн описание описание"
          " описание описание описание описание реальн описание описание описание описание описание описание реальн"
          " описание описание описание описание описание описание реальн описание описание описание описание описание описание реальн",
      audience: "Описание описание описание описание описание описание реальн описание описание описание описание "
          "описание описание реальн описание описание описание описание описание описание реальн описание описание"
          " описание описание описание описание реальн описание описание описание описание описание описание реальн"
          " описание описание описание описание описание описание реальн описание описание описание описание описание описание реальн",
      initialSkills: "Описание описание описание описание описание описание реальн описание описание описание описание "
          "описание описание реальн описание описание описание описание описание описание реальн описание описание"
          " описание описание описание описание реальн описание описание описание описание описание описание реальн"
          " описание описание описание описание описание описание реальн описание описание описание описание описание описание реальн"
  ),
  Course(id: 2, name: "Новый курс", numberStudents: 1000, tags: ["IT технологии"],
      description: "Описание курса", audience: "Для аудитории", initialSkills: "Не требуется",
      image: "https://pajournal.com.ua/wp-content/uploads/2021/07/learning-2707.jpg"),
  Course(id: 3, name: "Давайте рисовать!", numberStudents: 8, creator: User(name: "Марат Гумеров"), tags: ["Искусство"],
    description: "Описание курса", audience: "Для аудитории", initialSkills: "Не требуется"),
  Course(id: 4, name: "Новый курс", numberStudents: 1000, tags: ["IT технологии"],
      description: "Описание курса", audience: "Для аудитории", initialSkills: "Не требуется",
      image: "https://pajournal.com.ua/wp-content/uploads/2021/07/learning-2707.jpg"),
  Course(id: 5, name: "Давайте рисовать!", numberStudents: 8, creator: User(name: "Марат Гумеров"), tags: ["Искусство"],
    description: "Описание курса", audience: "Для аудитории", initialSkills: "Не требуется",),
  Course(id: 6, name: "Новый курс", numberStudents: 1000, tags: ["IT технологии"],
      description: "Описание курса", audience: "Для аудитории", initialSkills: "Не требуется",
      image: "https://pajournal.com.ua/wp-content/uploads/2021/07/learning-2707.jpg"),
]);